{"modelTopology":{"class_name":"Model","config":{"name":"model178","layers":[{"name":"input178","class_name":"InputLayer","config":{"batch_input_shape":[null,5],"dtype":"float32","sparse":false,"name":"input178"},"inbound_nodes":[]},{"name":"batch_normalization_BatchNormalization178","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization178","trainable":true},"inbound_nodes":[[["input178",0,0,{}]]]},{"name":"dense_Dense709","class_name":"Dense","config":{"units":100,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense709","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization178",0,0,{}]]]},{"name":"dense_Dense710","class_name":"Dense","config":{"units":98,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense710","trainable":true},"inbound_nodes":[[["dense_Dense709",0,0,{}]]]},{"name":"dense_Dense711","class_name":"Dense","config":{"units":96,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense711","trainable":true},"inbound_nodes":[[["dense_Dense710",0,0,{}]]]},{"name":"dense_Dense712","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense712","trainable":true},"inbound_nodes":[[["dense_Dense711",0,0,{}]]]}],"input_layers":[["input178",0,0]],"output_layers":[["dense_Dense712",0,0]]},"keras_version":"tfjs-layers 4.2.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"batch_normalization_BatchNormalization178/gamma","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization178/beta","shape":[5],"dtype":"float32"},{"name":"dense_Dense709/kernel","shape":[5,100],"dtype":"float32"},{"name":"dense_Dense709/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense710/kernel","shape":[100,98],"dtype":"float32"},{"name":"dense_Dense710/bias","shape":[98],"dtype":"float32"},{"name":"dense_Dense711/kernel","shape":[98,96],"dtype":"float32"},{"name":"dense_Dense711/bias","shape":[96],"dtype":"float32"},{"name":"dense_Dense712/kernel","shape":[96,1],"dtype":"float32"},{"name":"dense_Dense712/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization178/moving_mean","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization178/moving_variance","shape":[5],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.2.0","convertedBy":null}