{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_177","layers":[{"class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense705","trainable":true,"batch_input_shape":[null,5],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout529","trainable":true}},{"class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense706","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout530","trainable":true}},{"class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense707","trainable":true}},{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout531","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense708","trainable":true}}]},"keras_version":"tfjs-layers 4.2.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense705/kernel","shape":[5,64],"dtype":"float32"},{"name":"dense_Dense705/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense706/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense706/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense707/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense707/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense708/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense708/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.2.0","convertedBy":null}