{"modelTopology":{"class_name":"Model","config":{"name":"model160","layers":[{"name":"input160","class_name":"InputLayer","config":{"batch_input_shape":[null,5],"dtype":"float32","sparse":false,"name":"input160"},"inbound_nodes":[]},{"name":"batch_normalization_BatchNormalization160","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization160","trainable":true},"inbound_nodes":[[["input160",0,0,{}]]]},{"name":"dense_Dense637","class_name":"Dense","config":{"units":100,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense637","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization160",0,0,{}]]]},{"name":"dense_Dense638","class_name":"Dense","config":{"units":98,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense638","trainable":true},"inbound_nodes":[[["dense_Dense637",0,0,{}]]]},{"name":"dense_Dense639","class_name":"Dense","config":{"units":96,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense639","trainable":true},"inbound_nodes":[[["dense_Dense638",0,0,{}]]]},{"name":"dense_Dense640","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense640","trainable":true},"inbound_nodes":[[["dense_Dense639",0,0,{}]]]}],"input_layers":[["input160",0,0]],"output_layers":[["dense_Dense640",0,0]]},"keras_version":"tfjs-layers 4.2.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"batch_normalization_BatchNormalization160/gamma","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization160/beta","shape":[5],"dtype":"float32"},{"name":"dense_Dense637/kernel","shape":[5,100],"dtype":"float32"},{"name":"dense_Dense637/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense638/kernel","shape":[100,98],"dtype":"float32"},{"name":"dense_Dense638/bias","shape":[98],"dtype":"float32"},{"name":"dense_Dense639/kernel","shape":[98,96],"dtype":"float32"},{"name":"dense_Dense639/bias","shape":[96],"dtype":"float32"},{"name":"dense_Dense640/kernel","shape":[96,1],"dtype":"float32"},{"name":"dense_Dense640/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization160/moving_mean","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization160/moving_variance","shape":[5],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.2.0","convertedBy":null}