{"modelTopology":{"class_name":"Model","config":{"name":"model203","layers":[{"name":"input203","class_name":"InputLayer","config":{"batch_input_shape":[null,5],"dtype":"float32","sparse":false,"name":"input203"},"inbound_nodes":[]},{"name":"batch_normalization_BatchNormalization203","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization203","trainable":true},"inbound_nodes":[[["input203",0,0,{}]]]},{"name":"dense_Dense809","class_name":"Dense","config":{"units":100,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense809","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization203",0,0,{}]]]},{"name":"dense_Dense810","class_name":"Dense","config":{"units":98,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense810","trainable":true},"inbound_nodes":[[["dense_Dense809",0,0,{}]]]},{"name":"dense_Dense811","class_name":"Dense","config":{"units":96,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense811","trainable":true},"inbound_nodes":[[["dense_Dense810",0,0,{}]]]},{"name":"dense_Dense812","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense812","trainable":true},"inbound_nodes":[[["dense_Dense811",0,0,{}]]]}],"input_layers":[["input203",0,0]],"output_layers":[["dense_Dense812",0,0]]},"keras_version":"tfjs-layers 4.2.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"batch_normalization_BatchNormalization203/gamma","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization203/beta","shape":[5],"dtype":"float32"},{"name":"dense_Dense809/kernel","shape":[5,100],"dtype":"float32"},{"name":"dense_Dense809/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense810/kernel","shape":[100,98],"dtype":"float32"},{"name":"dense_Dense810/bias","shape":[98],"dtype":"float32"},{"name":"dense_Dense811/kernel","shape":[98,96],"dtype":"float32"},{"name":"dense_Dense811/bias","shape":[96],"dtype":"float32"},{"name":"dense_Dense812/kernel","shape":[96,1],"dtype":"float32"},{"name":"dense_Dense812/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization203/moving_mean","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization203/moving_variance","shape":[5],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.2.0","convertedBy":null}