{"modelTopology":{"class_name":"Model","config":{"name":"model148","layers":[{"name":"input148","class_name":"InputLayer","config":{"batch_input_shape":[null,5],"dtype":"float32","sparse":false,"name":"input148"},"inbound_nodes":[]},{"name":"batch_normalization_BatchNormalization148","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization148","trainable":true},"inbound_nodes":[[["input148",0,0,{}]]]},{"name":"dense_Dense589","class_name":"Dense","config":{"units":100,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense589","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization148",0,0,{}]]]},{"name":"dense_Dense590","class_name":"Dense","config":{"units":98,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense590","trainable":true},"inbound_nodes":[[["dense_Dense589",0,0,{}]]]},{"name":"dense_Dense591","class_name":"Dense","config":{"units":96,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense591","trainable":true},"inbound_nodes":[[["dense_Dense590",0,0,{}]]]},{"name":"dense_Dense592","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense592","trainable":true},"inbound_nodes":[[["dense_Dense591",0,0,{}]]]}],"input_layers":[["input148",0,0]],"output_layers":[["dense_Dense592",0,0]]},"keras_version":"tfjs-layers 4.2.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"batch_normalization_BatchNormalization148/gamma","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization148/beta","shape":[5],"dtype":"float32"},{"name":"dense_Dense589/kernel","shape":[5,100],"dtype":"float32"},{"name":"dense_Dense589/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense590/kernel","shape":[100,98],"dtype":"float32"},{"name":"dense_Dense590/bias","shape":[98],"dtype":"float32"},{"name":"dense_Dense591/kernel","shape":[98,96],"dtype":"float32"},{"name":"dense_Dense591/bias","shape":[96],"dtype":"float32"},{"name":"dense_Dense592/kernel","shape":[96,1],"dtype":"float32"},{"name":"dense_Dense592/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization148/moving_mean","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization148/moving_variance","shape":[5],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.2.0","convertedBy":null}